In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [3]:
# Load dataset
df = pd.read_csv("Retail_Sales_Dataset.csv")

In [4]:
# Preview data
df.head(10)

,Transaction ID,Date,Customer ID,Gender,Age,Product Category,Quantity,Price per Unit,Total Amount
0,1,2023-11-24,CUST001,Male,34,Beauty,3,50,150
1,2,2023-02-27,CUST002,Female,26,Clothing,2,500,1000
2,3,2023-01-13,CUST003,Male,50,Electronics,1,30,30
3,4,2023-05-21,CUST004,Male,37,Clothing,1,500,500
4,5,2023-05-06,CUST005,Male,30,Beauty,2,50,100
5,6,2023-04-25,CUST006,Female,45,Beauty,1,30,30
6,7,2023-03-13,CUST007,Male,46,Clothing,2,25,50
7,8,2023-02-22,CUST008,Male,30,Electronics,4,25,100
8,9,2023-12-13,CUST009,Male,63,Electronics,2,300,600
9,10,2023-10-07,CUST010,Female,52,Clothing,4,50,200

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 9 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Transaction ID    1000 non-null   int64
 1   Date              1000 non-null   object
 2   Customer ID       1000 non-null   object
 3   Gender            1000 non-null   object
 4   Age               1000 non-null   int64
 5   Product Category  1000 non-null   object
 6   Quantity          1000 non-null   int64
 7   Price per Unit    1000 non-null   int64
 8   Total Amount      1000 non-null   int64
dtypes: int64(5), object(4)
memory usage: 70.4+ KB

In [6]:
# Check for missing values
df.isnull().sum()

Transaction ID      0
Date                0
Customer ID         0
Gender              0
Age                 0
Product Category    0
Quantity            0
Price per Unit      0
Total Amount        0
dtype: int64

In [7]:
df.duplicated().sum()

np.int64(0)

In [8]:
df['Date'] = pd.to_datetime(df['Date'])

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 9 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Transaction ID    1000 non-null   int64
 1   Date              1000 non-null   datetime64[ns]
 2   Customer ID       1000 non-null   object
 3   Gender            1000 non-null   object
 4   Age               1000 non-null   int64
 5   Product Category  1000 non-null   object
 6   Quantity          1000 non-null   int64
 7   Price per Unit    1000 non-null   int64
 8   Total Amount      1000 non-null   int64
dtypes: datetime64[ns](1), int64(5), object(3)
memory usage: 70.4+ KB

In [10]:
df['Year'] = df['Date'].dt.year
df['Month'] = df['Date'].dt.month_name()

In [11]:
df.head()

,Transaction ID,Date,Customer ID,Gender,Age,Product Category,Quantity,Price per Unit,Total Amount,Year,Month
0,1,2023-11-24,CUST001,Male,34,Beauty,3,50,150,2023,November
1,2,2023-02-27,CUST002,Female,26,Clothing,2,500,1000,2023,February
2,3,2023-01-13,CUST003,Male,50,Electronics,1,30,30,2023,January
3,4,2023-05-21,CUST004,Male,37,Clothing,1,500,500,2023,May
4,5,2023-05-06,CUST005,Male,30,Beauty,2,50,100,2023,May

In [12]:
top_products = (
    df.groupby('Product Category')['Total Amount']
    .sum()
    .sort_values(ascending=False)
    .head(5)
)
print(top_products)

Product Category
Electronics    156905
Clothing       155580
Beauty         143515
Name: Total Amount, dtype: int64

In [13]:
gender_sales = (
    df.groupby('Gender')['Total Amount']
    .sum()
    .sort_values(ascending=False)
)
print(gender_sales)

Gender
Female    232840
Male      223160
Name: Total Amount, dtype: int64

In [14]:
monthly_sales = (
    df.groupby(['Year', 'Month'])['Total Amount']
    .sum()
    .reset_index()
)
print(monthly_sales.head(12))

    Year      Month  Total Amount
0   2023      April         33870
1   2023     August         36960
2   2023   December         44690
3   2023   February         44060
4   2023    January         35450
5   2023       July         35465
6   2023       June         36715
7   2023      March         28990
8   2023        May         53150
9   2023   November         34920
10  2023    October         46580
11  2023  September         23620

In [15]:
df.to_csv("Cleaned_Retail_Sales.csv", index=False)